import re

def test_nikkud():
    text = """אִי סָבַר לַהּ כְּרַבִּי יְהוּדָה בֶּן בְּתִירָה נֵימָא כְּוָוֽתֵיֽהּ קָסָבַר רַבִּי עֲקִיבָא כִּי כְּתִיב נִיֽסּוּךְ יַתִּירָא בְּשִׁשִּׁי הוּא דִּכְתִיב
תַּנְיָא רַבִּי נָתָן אוֹמֵר בַּקֹּדֶשׁ הַסֵּךְ נֶסֶךְ שֵׁכָר לַה' בִּשְׁנֵי נִיֽסּוּכִין הַכָּתוּב מְדַבֵּר אֶחָד נִיֽסּוּךְ הַמַּיִם וְאֶחָד נִיֽסּוּךְ הַיַּיִן אֵימָא תַּרְוַיְיֽהוּ דְּחַמְרָא אִם כֵּן לִכְתֹּוֽב קְרָא אוֹ הַסֵּךְ הַסֵּךְ אוֹ נֶסֶךְ נֶסֶךְ מַאי הַסֵּךְ נֶסֶךְ שָׁמְעַתְּ מִיֽנַּהּ חַד דְּמַיָּא וְחַד דְּחַמְרָא
"""
    unvocalized_text = re.sub(r'[ְֱִֵֶַָֹֻּֽ◌ֲ]', '', text, flags=re.IGNORECASE)
    unvocalized_text = re.sub(r'[שׁשׂ]', 'ש', unvocalized_text, flags=re.IGNORECASE)
    print(unvocalized_text)

if __name__ == "__main__":
    print(test_nikkud())